[
  {
    "rank": 1,
    "course_name": "Pebble Beach",
    "city": "Pebble Beach",
    "state": "CA ",
    "img_url": "https://golf.com/wp-content/uploads/2019/11/pebble-beach-evan-schiller.jpg",
    "architect": " Jack Neville/Douglas Grant",
    "year_built": 1919,
    "description": "The first great American public oceanside course, Pebble benefits from an ingenious routing that brings the player right to the ocean's edge, then away into the woods, then back again. Even today, no more thrilling, spectacular stretch exists than holes 4 through 10. Does anything in golf compare with that final stroll up the par-5 18th as it curves left around Carmel Bay? Hard for a course this well known to exceed first time expectations — but it does, which is a true feat. Max fee: $575, resort guest; $620, non-resort guest. (Photo: Evan Schiller)",
    "detailed_location": {
      "address": "Pebble Beach, Del Monte Forest, CA 93953, USA",
      "lat": 36.5666274,
      "lng": -121.9474556
    }
  },
  {
    "rank": 2,
    "course_name": "Pinehurst (No. 2)",
    "city": "Village of Pinehurst",
    "state": "NC",
    "img_url": "https://golf.com/wp-content/uploads/2020/04/Pinehurst-2-15H-092213-0763-_.jpg",
    "architect": "Donald Ross",
    "year_built": 1907,
    "description": "Donald Ross's chef d'oeuvre rolls spaciously through tall longleaf pines in the Carolina Sandhills with holes culminating with legendary inverted-saucer greens. For the 2014 U.S. Open, a Coore-Crenshaw restoration brought back the tawny-edged fairways and native areas last seen in the 1940s. Even with no rough, the runner-up could muster only one under par over four rounds. After the Women’s U.S. Open was played the following week, a powerful message had been broadcast around the world from the home of American golf about the virtues of width, short grass and great greens. This is one of a handful of courses that presents resort guests with a fun test on which they won’t lose a single ball, and a week later, can be ready to host a U.S. Open. That’s the flexibility of short grass — and Ross’s design genius. Max fee: $495. (Photo: Joann Dost)",
    "detailed_location": {
      "address": "1 Carolina Vista Dr, Pinehurst, NC 28374, USA",
      "lat": 35.1903489,
      "lng": -79.4679116
    }
  },
  {
    "rank": 3,
    "course_name": "Pacific Dunes",
    "city": "Bandon",
    "state": "OR",
    "img_url": "https://golf.com/wp-content/uploads/2020/04/pacific-dunes-evan-schiller-1024x570-1.jpg",
    "architect": "Tom Doak",
    "year_built": 2001,
    "description": "This unconventional Doak delight catapulted him into the spotlight. A slew of par-4s on the first nine gives way to a peculiar 3-3-5-4-3-5 start to the second nine. Only Mike Keiser would have approved of such an unusual sequence and this course helped modern architecture break free from some certain design shackles that had constrained designers over the past five decades. Scattered blow-out bunkers, gigantic natural dunes, smartly contoured greens and Pacific panoramas complete Doak’s first masterpiece. Max fee: $295, resort guest; $345, non-resort guest. (Photo: Evan Schiller)",
    "detailed_location": {
      "address": "Bandon, OR 97411, USA",
      "lat": 43.1936178,
      "lng": -124.3899316
    }
  },
  {
    "rank": 4,
    "course_name": "Cabot Cliffs",
    "city": "Inverness",
    "state": "Nova Scotia ",
    "img_url": "https://golf.com/wp-content/uploads/2021/05/cabot-cliffs.jpg",
    "architect": "Bill Coore/Ben Crenshaw",
    "year_built": 2016,
    "description": "Newly minted as Canada's top-ranked course, this four-year-old Bill Coore/Ben Crenshaw design towers more than 100 feet above the Gulf of St. Lawrence, inspiring Pebble Beach-like awe. The south-end holes are akin to a traditional Scottish links. Most memorable is the trio of stunning closing holes, beginning with the 176-yard, par-3 16th, played out over the cliffs that give the course its name. Max fee: $245. (Photo: Brian Oar)",
    "detailed_location": {
      "address": "15933 Central Ave, Inverness, NS B0E 1N0, Canada",
      "lat": 46.2365266,
      "lng": -61.30223590000001
    }
  },
  {
    "rank": 5,
    "course_name": "Bethpage (Black)",
    "city": "Farmingdale",
    "state": "NY",
    "img_url": "https://golf.com/wp-content/uploads/2020/08/bethpage-4.jpg",
    "architect": "A.W. Tillinghast",
    "year_built": 1935,
    "description": "The Black intimidates golfers with a sign at the 1st tee that recommends the course “only for highly skilled golfers.” Among the highly skilled? Tiger Woods, who won the 2002 \"People's Open,\" as that U.S. Open came to be known. Woods was the only golfer to break par for 72 holes, owing to rugged, uphill par-4s, massive bunkers and the wrist-fracturing rough found on this Rees Jones-restored A.W. Tillinghast layout. The Black is one of the great routings, highlighted by the masterful way Tillinghast placed the fairways and greens from the 2nd hole in a valley all the way through the dogleg left 9th. The par-5 4th and its iconic cross-bunkering is a world-beater. Max fee: $80, resident; $150, non-resident. (Photo: Getty Images)",
    "detailed_location": {
      "address": "99 Quaker Meeting House Rd, Farmingdale, NY 11735, USA",
      "lat": 40.7428649,
      "lng": -73.4550769
    }
  },
  {
    "rank": 6,
    "course_name": "Kiawah Island (Ocean)",
    "city": "Kiawah Island",
    "state": "SC ",
    "img_url": "https://golf.com/wp-content/uploads/2018/07/Kiawah.jpg",
    "architect": "Pete Dye",
    "year_built": 1991,
    "description": "The blend of tidal marshes, scrub-topped dunes, live oaks and the soothing sound of the Atlantic on every hole make this one of the South’s most memorable playing experiences. Though the course is barely 30 years old, it already has an illustrious history of hosting famous events, none more so than the drama-filled 1991 \"War by the Shore\" Ryder Cup. Much more short grass has been added around the green complexes since then and now the design is more thought-provoking rather than terror-inducing. Look for four of its plateau greens, namely those at the 2nd, 3rd, 11th and 14th, to have a large say in who wins the 2021 PGA Championship. Max fee: $463 (Photo: Courtesy Kiawah Island Resort)",
    "detailed_location": {
      "address": "1 Sanctuary Beach Dr, Kiawah Island, SC 29455, USA",
      "lat": 32.603865,
      "lng": -80.09462099999999
    }
  },
  {
    "rank": 7,
    "course_name": "Casa De Campo (Teeth of the Dog)",
    "city": "La Romana",
    "state": "Dominican Republic",
    "img_url": "https://golf.com/wp-content/uploads/2020/01/TeethoftheDog5.jpg",
    "architect": "Pete Dye",
    "year_built": 1971,
    "description": "Pete Dye's personal favorite of all of his designs, Teeth of the Dog is flat-out gorgeous, with seven holes practically sunk into the Caribbean Sea. The design itself stands up to the aesthetics. Despite its intimidating name, Teeth of the Dog entrances, starting with its superior collection of par-3s. Max fee:  $265, resort guest; $415, non-resort guest. (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "La Romana 22000, Dominican Republic",
      "lat": 18.4121426,
      "lng": -68.9341029
    }
  },
  {
    "rank": 8,
    "course_name": "Bandon Trails",
    "city": "Bandon",
    "state": "OR",
    "img_url": "https://golf.com/wp-content/uploads/2020/08/Bandon-trails-17th.jpg",
    "architect": "Bill Coore/Ben Crenshaw",
    "year_built": 2005,
    "description": "Several of Coore & Crenshaw’s finest designs are located at hard-to-access private clubs but many of their works thankfully are available to the public, often courtesy of Mike Keiser. This is one of their best — public or private. The routing works its way over and across heaving dunes and through an enchanting coastal forest, and the fact that you don’t miss the sight of the water for most of the round speaks volumes to its design quality. Max fee: $295, resort guests; $345, non-resort guests. (Photo: Getty Images)",
    "detailed_location": {
      "address": "Bandon, OR 97411, USA",
      "lat": 43.1847515,
      "lng": -124.391157
    }
  },
  {
    "rank": 9,
    "course_name": "Bandon Dunes",
    "city": "Bandon",
    "state": "OR ",
    "img_url": "https://golf.com/wp-content/uploads/2016/11/Bandon-Dunes_Wood-Sabold.jpg",
    "architect": "David McLay Kidd",
    "year_built": 1999,
    "description": "Bandon's original course is a David McLay Kidd design draped atop craggy headlands above the Pacific. Ocean views stun the senses, along with bluff-top sand dunes sprinkled with Scotch broom and gorse bushes, coastal pines, crashing surf, wind-whipped tall native grasses and stacked sod bunkers. The most memorable seaside tests are the par-4 4th and 5th, the par-3 12th and the drivable par-4 16th, each with eye-popping scenery and enjoyable risk/rewards. No surprise, the 2020 U.S. Amateur telecast from here was captivating. Max fee: $295, resort guests; $345, non-resort guests. (Photo: Wood Sabold)",
    "detailed_location": {
      "address": "Bandon, OR 97411, USA",
      "lat": 43.1876666,
      "lng": -124.3907478
    }
  },
  {
    "rank": 10,
    "course_name": "TPC Sawgrass (Stadium)",
    "city": "Ponte Vedra Beach",
    "state": "FL ",
    "img_url": "https://golf.com/wp-content/uploads/2016/11/TPC-Sawgrass-54_0.jpg",
    "architect": "Pete Dye",
    "year_built": 1981,
    "description": "Some sniff at the artificiality of a course being hewn from a swamp, yet that’s also what makes the Stadium Course stand out from the crowd. Home of the Players Championship since 1982, the design has evolved into a handsome battleground (however you feel about the towering clubhouse), highlighting Pete Dye’s talent for envisioning something from nothing. The short par-4 4th, reachable par-5 11th and the long par-4 14th rank among Dye’s all-time best. For shotmaking options and memorable individual holes that require a blend of power and finesse, the Stadium Course has few peers. Max fee: $720 (Photo: Chris Condon/Getty Images)",
    "detailed_location": {
      "address": "110 Championship Way, Ponte Vedra Beach, FL 32082, USA",
      "lat": 30.1980135,
      "lng": -81.3954708
    }
  },
  {
    "rank": 11,
    "course_name": "Whistling Straits (Straits)",
    "city": "Sheboygan",
    "state": "WI ",
    "img_url": "https://golf.com/wp-content/uploads/2020/10/whistling-straits.jpg",
    "architect": "Pete Dye",
    "year_built": 1998,
    "description": "Venue of the 2004, '10 and '15 PGA Championships, this 1998 Pete Dye design on Lake Michigan was once a poker table-flat military training base in World War II. Eventually it became a site for illegal dumping of toxic waste. Dye and owner Herb Kohler engineered a mind-boggling cleanup, moved 3 million cubic yards of dirt, trucked in 7,000 loads of sand to create the hills and bunkers and relocated the bluffs back off the shore. All Kohler told Dye was \"I want the course to look like it's in Ireland.\" Mission accomplished. Buckle up when the Ryder Cup visits the Straits course in September. Max fee: $485. (Photo: Getty Images)",
    "detailed_location": {
      "address": "N8501 Lakeshore Rd, Sheboygan, WI 53083, USA",
      "lat": 43.8510583,
      "lng": -87.73514159999999
    }
  },
  {
    "rank": 12,
    "course_name": "Cabot Links",
    "city": "Inverness",
    "state": "Nova Scotia",
    "img_url": "https://golf.com/wp-content/uploads/2019/09/CabotLinks4.jpg",
    "architect": "Rod Whitman",
    "year_built": 2012,
    "description": "Developers Ben Cowan-Dewar and Mike Keiser handed over a rolling plot of coastal Nova Scotia terrain to Canadian architect Rod Whitman. The result is Canada's first authentic links. Firm, rumpled, fescue fairways, coastal breezes and endless views of the Gulf of St. Lawrence make it abundantly clear why Nova Scotia is the Latin name for “New Scotland.” Whitman’s talent for adding micro-contours in and around the greens is unsurpassed but are overlooked here because the views are so spectacular. Max fee: $245, resort guest; $290, non-resort guest. (Photo: Courtesy of Cabot Links)",
    "detailed_location": {
      "address": "15933 Central Ave, Inverness, NS B0E 1N0, Canada",
      "lat": 46.2365266,
      "lng": -61.30223590000001
    }
  },
  {
    "rank": 13,
    "course_name": "Pasatiempo",
    "city": "Santa Cruz",
    "state": "CA",
    "img_url": "https://golf.com/wp-content/uploads/2020/10/Pasatiempo.jpg",
    "architect": "Alister MacKenzie",
    "year_built": 1929,
    "description": "Alister MacKenzie calls Pasatiempo the finest course he ever built. Unlike Cypress Point, just an hour south, Pasatiempo sits slightly inland, but its high points offer views of the Pacific and the entire routing, with its giant paw-print bunkers and large, undulating greens, make plain the influence that this course had on MacKenzie’s later work at Augusta National. Charms and challenges abound, from the long, uphill par-3 3rd to the par-4 16th, a humpbacked dogleg with a second shot that plays over a chasm to a wild and winning three-tiered green. Some nitpickers grouse that the course is pinched by homes. But one of those houses belonged to MacKenzie, who chose to reside beside the par-5 6th. Max fee: $325. (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "Pasatiempo, CA 95060, USA",
      "lat": 37.0043938,
      "lng": -122.0257963
    }
  },
  {
    "rank": 14,
    "course_name": "Gamble Sands",
    "city": "Brewster",
    "state": "WA",
    "img_url": "https://golf.com/wp-content/uploads/2020/10/gamble-sands.jpg",
    "architect": "David McLay Kidd",
    "year_built": 2014,
    "description": "After stamping his name on some penal, polarizing courses, Bandon Dunes designer David McLay Kidd had what he described as a come-to-the-mountain moment. It was time to revert to what had worked so well at Bandon and place a renewed emphasis on fun. In apple-orchard country in Eastern Washington, Kidd shaped fairways as wide as airstrips, but he gave them ample movement while adding contours that steer borderline shots away from trouble. Greens are sizable and rumpled, too, with tightly mown runoffs where putter is often the wiser choice than wedge. “Fun,” it turns out, isn’t losing your ball. It’s finding it with ease, and then sorting through the many options for how to play it next. Max fee: $175+ (increases with demand). (Photo: Brian Oar)",
    "detailed_location": {
      "address": "200 Sands Trail Rd, Brewster, WA 98812, USA",
      "lat": 48.0764083,
      "lng": -119.6540985
    }
  },
  {
    "rank": 15,
    "course_name": "Old Macdonald",
    "city": "Bandon",
    "state": "OR",
    "img_url": "https://golf.com/wp-content/uploads/2020/10/old-macdonald.jpg",
    "architect": "Tom Doak/Jim Urbina",
    "year_built": 2010,
    "description": "True to its name, this Tom Doak-Jim Urbina collaboration pays tribute to the Golden Age giant, Charles Blair Macdonald, who himself was famed for paying tribute through his portfolio of template holes. The Redan. The Short. The Long. The Eden. Nods to all of these are on display here, along with cap-tips to the Road Hole at St. Andrews and the Double Plateau green that Macdonald first employed at National Golf Links. Yet for all its emulation, Old MacDonald leaves a unique impression, with deep, riveted bunkers and firm fescue turf that make for as faithful an Old World links experience as any public-access course in the United States. Max fee: $295, resort guests; $345 non-resort guests. (Photo: Evan Schiller)",
    "detailed_location": {
      "address": "57744 Round Lake, Bandon, OR 97411, USA",
      "lat": 43.1878897,
      "lng": -124.3902642
    }
  },
  {
    "rank": 16,
    "course_name": "Harbour Town",
    "city": "Hilton Head Island",
    "state": "SC",
    "img_url": "https://golf.com/wp-content/uploads/2021/05/harbour-town.jpg",
    "architect": "Pete Dye/Jack Nicklaus",
    "year_built": 1969,
    "description": "The professionals weren’t sure what to make of Harbour Town when they first tangled with it in the early 1970s. Unlike so many other courses being built in that timeframe, this design by Nicklaus and Dye didn’t rely on length as much as it did in having unique green shapes that were in turn protected by all sorts of hazards, including railroad ties at the 13th green. Standout holes abound, including the V-shaped green at the short 9th and the finishing stretch from 13 in. Even 50 years after their construction, these exemplar holes remain as compelling and interesting as anything that modern architecture has to offer. Max fee: $370. (Photo: Sea Pines Resort/Rob Tipton)",
    "detailed_location": {
      "address": "Harbour Town, Hilton Head Island, SC 29928, USA",
      "lat": 32.1386103,
      "lng": -80.81078699999999
    }
  },
  {
    "rank": 17,
    "course_name": "Banff Springs",
    "city": "Banff",
    "state": "Alberta",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/banff.jpg",
    "architect": "Stanley Thompson",
    "year_built": 1928,
    "description": "With the steep slopes of Mt. Rundle rising on one side and the Bow River flowing on the other, Banff showcases the work of Canada’s greatest architect on perhaps the greatest site he was ever given. The staggering setting makes a fitting backdrop for Thompson’s myriad artistic touches, including  inventively shaped bunkers, replete with fingers and islands and flashes, that count among the hallmarks of his style. Every hole is named, and rightfully so, given their distinctive personalities. But none is more famous than the par-3 4th, known as Devil’s Cauldron, which plays over a lake to a bowl-shaped green at the mountain’s base. Max fee: $299. (Photo: Jacob Sjoman)",
    "detailed_location": {
      "address": "405 Spray Ave, Banff, AB T1L 1J4, Canada",
      "lat": 51.164322,
      "lng": -115.5618219
    }
  },
  {
    "rank": 18,
    "course_name": "Cap Cana (Punta Espada)",
    "city": "Punta Cana",
    "state": "Dominican Republic",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/capcana.jpg",
    "architect": "Jack Nicklaus",
    "year_built": 2006,
    "description": "Hollywood never conjured bluer lagoons than those that come in play on this Nicklaus Signature Design, a former stop on the Tour’s senior circuit. Nearly half the holes skirt the island shoreline. Others run atop alabaster cliffs. With emerald fairways spilling into white sand wastes, which in turn give way to turquoise waters, the layout has the look of a tropical postcard. But the pretty picture can be plenty penal. Take the 13th hole, a 250-yard par-3 that requires an Evel Knievel carry over an ocean inlet, with waves frothing against the cliffs below. Max fee: $395 (Photo: Courtesy Cap Cana)",
    "detailed_location": {
      "address": "Cap Cana, Punta Cana 23000, Dominican Republic",
      "lat": 18.4548538,
      "lng": -68.4152462
    }
  },
  {
    "rank": 19,
    "course_name": "Streamsong (Red)",
    "city": "Bowling Green",
    "state": "FL",
    "img_url": "https://golf.com/wp-content/uploads/2020/10/streamsong-red.jpg",
    "architect": "Bill Coore/Ben Crenshaw",
    "year_built": 2012,
    "description": "When the modern minimalism of Coore and Crenshaw meets the heaving, sandy landscape of a former phosphate mine, the result has more in common with a Scottish links than it does with a typical Florida design. Forget soft landings on flat, water-laden fairways. Like its Streamsong siblings, the Blue and Black courses, the Red is built for bouncy, rollicking play. There’s some leeway off the tee. But attacking from the proper angle is essential. So is a knack for creative shot-making. The ground game is more welcome here than almost anywhere in the Sunshine State. Max fee: $259, resort guest; $299, non-resort guest. (Photo: Getty Images)",
    "detailed_location": {
      "address": "1000 Streamsong Dr, Bowling Green, FL 33834, USA",
      "lat": 27.6928094,
      "lng": -81.9344824
    }
  },
  {
    "rank": 20,
    "course_name": "Sheep Ranch",
    "city": "Bandon",
    "state": "OR",
    "img_url": "https://golf.com/wp-content/uploads/2019/10/sheep-ranch-12.jpg",
    "architect": "Bill Coore & Ben Crenshaw",
    "year_built": 2020,
    "description": "A masterpiece of routing, the newest addition at Bandon Dunes occupies the smallest plot of the property’s five 18-hole courses but boasts the longest stretch of coastline, with nine greens set on the seaside bluffs. Another striking feature is the absence of bunkers. Holes are framed instead by gorse, native grasses and a smattering of dead trees known as “snags.” Several of these ghostly sentinels stand astride the par-5 1st hole, which bends over a ridge and toward the water for one of the game’s most stirring ocean reveals. Max fee: $295, resort guests; $345, non-resort guests. (Photo: Courtesy Bandon Dunes)",
    "detailed_location": {
      "address": "Bandon, OR 97411, USA",
      "lat": 43.2209625,
      "lng": -124.3888092
    }
  },
  {
    "rank": 21,
    "course_name": "Shadow Creek",
    "city": "North Las Vegas",
    "state": "NV",
    "img_url": "https://golf.com/wp-content/uploads/2018/11/shadow-creek-golf-course-1-1.jpg",
    "architect": "Tom Fazio",
    "year_built": 1990,
    "description": "This high-rollers’ redoubt, 20 minutes from the Strip, is both a work of architecture and a feat of engineering. Bankrolled by the casino magnate Steve Wynn, Tom Fazio busted out the bulldozers and backhoes to dig a giant footprint in the flat Nevada desert, moving a small planet’s worth of dirt and planting more than 20,000 mature pines, so that each hole stands in seclusion from the others. Gurgling streams and waterfalls enhance the sense of opulence, and the risk-rewards make for great match-play entertainment. Nowhere is this truer than on the par-5, par-3, par-5 finish, a rousing stage for settling bets. When the PGA Tour visited in 2020, players compared the course’s pristine conditioning to that of Augusta National’s. Max fee: $600. (Photo: Brian Oar)",
    "detailed_location": {
      "address": "3 Shadow Creek Dr, North Las Vegas, NV 89081, USA",
      "lat": 36.2584295,
      "lng": -115.1073027
    }
  },
  {
    "rank": 22,
    "course_name": "Prairie Club (Dunes)",
    "city": "Valentine",
    "state": "NB",
    "img_url": "https://golf.com/wp-content/uploads/2020/10/prairie-club-dunes.jpg",
    "architect": "Tom Lehman/Chris Brands",
    "year_built": 2010,
    "description": "Co-architect Tom Lehman set out to build a walkable course very much in harmony with nature. He and partner Chris Brands more than succeeded, turning this former cattle ranch into an epic homage to links golf. Carved out of rolling sand hills hard by the Snake River, the Dunes Course has it all — sweeping vistas, rolling fairways, enormous bunkers and imaginative green complexes. A taste of Scotland in the middle of Nebraska, this is Lehman’s second major and it features some of the widest fairways on our list. Max fee: $132.50, hosted guest; $199.50, public. (Photo: Brian Oar)",
    "detailed_location": {
      "address": "88897 NE-97, Valentine, NE 69201, USA",
      "lat": 42.7299433,
      "lng": -100.7932932
    }
  },
  {
    "rank": 23,
    "course_name": "Lawsonia (Links)",
    "city": "Green Lake",
    "state": "WI",
    "img_url": "https://golf.com/wp-content/uploads/2020/10/lawsonia-links.jpg",
    "architect": "Bill Langford/Ted Moreau",
    "year_built": 1930,
    "description": "Golden Age masters Langford & Moreau spent nearly $4 million in 2020 dollars to build this literally ground-breaking Wisconsin layout. Steam shovels shaped its most spectacular features, including some of the boldest putting complexes on the planet. Rumor has it a boxcar was buried under the 7th green to create the dramatic 20-foot drop-off. The result of all this mechanical wizardry? Possibly the most underrated course in America and its greatest golfing value. We almost feel guilty finally sharing the secret. Max fee: $95. (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "W2615 S Valley View Dr, Green Lake, WI 54941, USA",
      "lat": 43.8291742,
      "lng": -89.0125379
    }
  },
  {
    "rank": 24,
    "course_name": "Jasper Park Lodge",
    "city": "Jasper",
    "state": "Alberta",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/jasper.jpg",
    "architect": "Stanley Thompson",
    "year_built": 2015,
    "description": "“Nature must always be the architect’s model,” Stanley Thompson once wrote, underscoring a principle that finds exhilarating expression at Jasper Park. Located in a national park of the same name, the course offers arresting long views of the Canadian Rockies and stirring close encounters with the crystalline waters of Lake Beauvert. Taking his own ethos to heart, Thompson aligned fairways with the surrounding mountains and shaped green complexes whose contours mirror the outlines of the distant ridges. Along the way, he also created what many regard as the finest collection of par-3s in Canada. Max fee: $239 (Photo: Brian Oar)",
    "detailed_location": {
      "address": "1 Old Lodge Rd, Jasper, AB T0E 1E0, Canada",
      "lat": 52.885946,
      "lng": -118.0571361
    }
  },
  {
    "rank": 25,
    "course_name": "Sand Valley (Sand Valley)",
    "city": "Nekooska",
    "state": "WI",
    "img_url": "https://golf.com/wp-content/uploads/2020/04/Hafer_Drone_SandValley_72619-01005.jpg",
    "architect": "Bill Coore and Ben Crenshaw",
    "year_built": 2017,
    "description": "Like Lennon and McCartney, Coore and Crenshaw can’t stop turning out hits that thrill the public and critics alike, this time working their magic on a sea of prehistoric Wisconsin sand. After an opening tee shot from a massive dune dubbed The Volcano, Sand Valley bewitches players with firm fairways, majestic bunkers and one of the great punchbowl greens. Visionary owner Mike Keiser said the land reminded him of a cross between Sand Hills and Pine Valley. Coore and Crenshaw more than delivered on that promise. Max fee: $225. (Photo: Christian Hafer)",
    "detailed_location": {
      "address": "1697 Leopold Way, Nekoosa, WI 54457, USA",
      "lat": 44.17172410000001,
      "lng": -89.8555098
    }
  },
  {
    "rank": 26,
    "course_name": "Pinehurst (No. 4)",
    "city": "Pinehurst",
    "state": "NC",
    "img_url": "https://golf.com/wp-content/uploads/2020/10/Pinehurst-4-Hole-2-5-1.jpg",
    "architect": "Donald Ross, 1919/Gil Hanse and Jim Wagner, 2017",
    "year_built": 1919,
    "description": "Renovating a course that rubs up against Pinehurst No. 2 is a brutal assignment because comparisons are inevitable. So, what did Gil Hanse and Jim Wagner do in 2017 when the task fell to them? First, they made sure that the course looked like it belonged on the same large swath of property as Pinehurst No. 2. A lot of work went into reconnecting the course to the ground and wiping away extraneous movement that had been added over the decades since Ross’s passing. Second, they studiously built a set of greens that in no way mimic No. 2’s but rather stand on their own, diverse merit. Pinehurst No. 4 features much more land movement than Pinehurst No. 2 and Hanse Design captured it to perfection in the stretch from 4 to 12. The home hole, with its call for a draw off the tee and a fade into the green, is a fitting conclusion and the iconic Pinehurst clubhouse in the background doesn’t hurt either. Max fee: $395. (Photo: Chip Henderson)",
    "detailed_location": {
      "address": "1 Carolina Vista Dr, Pinehurst, NC 28374, USA",
      "lat": 35.1881195,
      "lng": -79.4657546
    }
  },
  {
    "rank": 27,
    "course_name": "Streamsong (Blue)",
    "city": "Bowling Green",
    "state": "FL",
    "img_url": "https://golf.com/wp-content/uploads/2020/10/streamsong-blue.jpg",
    "architect": "Tom Doak",
    "year_built": 2012,
    "description": "Tom Doak and Bill Coore literally shared holes and land as they built the Blue and Red courses in a collaborative spirit. To a certain extent, that means the two courses also share the spotlight, which may not be fair to either, as both are standouts. A talented greenkeeper pushes the dormant Bermuda fairways to tawny perfection during the winter months (no overseeding here!) and the firm playing surfaces can make a hole like the 6th, with its green that races away, exasperating. The in-your-face 4th climbs a ridge and some contend this is the best hole of the 54 at this luxe resort. The par-5 17th, with its appealing cross hazard, and the long two-shot 18th, where the ground game is the star are as good a 1-2 finishing punch as Doak has ever built. Max fee: $259, resort guests; $299, non-resort guests. (Photo: Larry Lambrecht)",
    "detailed_location": {
      "address": "1000 Streamsong Dr, Bowling Green, FL 33834, USA",
      "lat": 27.6928094,
      "lng": -81.9344824
    }
  },
  {
    "rank": 28,
    "course_name": "Cape Breton (Highlands Links)",
    "city": "Ingonish Beach",
    "state": "Nova Scotia",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/capebreton.jpg",
    "architect": "Stanley Thompson",
    "year_built": 1941,
    "description": "At Stanley Thompson’s “Mountains and Ocean” course, golfers stroll beside the Atlantic Ocean one moment (the 6th) before two holes later transitioning into the mountains. Set in the Cape Breton Highlands National Park, Highland Links all adds up to an unforgettably diverse playing experience, capped by a superior set of Thompson greens. The course’s set of par-5s (Nos. 6, 7, 15 and 16) is rightly considered among the best in all of golf. Max fee: $130 (Photo: Courtesy Cape Breton Highlands Links)",
    "detailed_location": {
      "address": "Cape Breton Highlands Links, Middle Head Peninsula, 247 Keltic in Rd, Ingonish Beach, NS B0C 1L0, Canada",
      "lat": 46.655991,
      "lng": -60.385084
    }
  },
  {
    "rank": 29,
    "course_name": "Sand Valley (Mammoth Dunes)",
    "city": "Nekooska",
    "state": "WI",
    "img_url": "https://golf.com/wp-content/uploads/2020/10/courtesy-mammoth-dunes.jpg",
    "architect": "David McLay Kidd",
    "year_built": 2018,
    "description": "The first thing you notice at Mammoth Dunes is how big it is. Surrounded by sand and playing to a par of 73, the massive layout winds around a towering V-shaped ridge. But the point is beauty, not intimidation. Architect David McLay Kidd, once known as a staunch defender of par, intentionally softened his approach here, following his grand success at the equally player friendly Gamble Sands. The wide, nearly unmissable fairways offer players multiple angles of attack into generous greens. The result? Mammoth Dunes is a welcome reminder that a great course can also be eminently fair and fun to play. Max fee: $225 (Photo: Courtesy Mammoth Dunes)",
    "detailed_location": {
      "address": "1697 Leopold Way, Nekoosa, WI 54457, USA",
      "lat": 44.17172410000001,
      "lng": -89.8555098
    }
  },
  {
    "rank": 30,
    "course_name": "Spyglass Hill",
    "city": "Pebble Beach",
    "state": "CA",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/spyglass.jpg",
    "architect": "Robert Trent Jones Sr.",
    "year_built": 1966,
    "description": "The toughest of the three sites in Pebble’s celebrity pro-am rota, this imposing design plays like two courses in one. After plunging toward the ocean on its opening par-5, the routing romps through coastal dunes, a charming stretch highlighted by the crafty par-4 4th, with its slender, angled green that runs away from the player. Two holes later, it’s back into the trees, where a different sort of test awaits from long doglegs and hero shots to pond-fringed targets. Emblematic of the challenge is the par-4 16th, a 476-yard, elbowed beast that, year after year, ranks among the hardest holes on Tour. Max fee: $415 (Photo: Channing Benjamin)",
    "detailed_location": {
      "address": "3206 Stevenson Dr, Pebble Beach, CA 93953, USA",
      "lat": 36.5823625,
      "lng": -121.9582542
    }
  },
  {
    "rank": 31,
    "course_name": "Erin Hills",
    "city": "Hartford",
    "state": "WI ",
    "img_url": "https://golf.com/wp-content/uploads/2020/05/erin-hills-green.jpg",
    "architect": "Michael Hurdzan/Dana Fry",
    "year_built": 2006,
    "description": "Set across glacial landforms, this U.S. Open site is highly memorable. Highlights include the tiny 2nd green that gives that short two-shotter its bite, and the long but slender hit-it-or-else green at the par-3 9th — miss left or right and a game of Ping-Pong can break out across the narrow putting surface. The second nine has exquisite undulations, including on the tumbling 12th fairway, which captures Erin Hills’ magic. At the 2017 U.S. Open here, Brooks Koepka’s superior ball-striking (he finished 1st in GIR, T4 for fairways hit and 7th in driving distance) proved to be a roadmap for success. Max fee: $320 (Photo: Christian Hafer)",
    "detailed_location": {
      "address": "7169 Co Rd O, Hartford, WI 53027, USA",
      "lat": 43.2458853,
      "lng": -88.3985043
    }
  },
  {
    "rank": 32,
    "course_name": "Mid Ocean Club",
    "city": "Tucker’s Town",
    "state": "St. George's Parish",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/midocean2.jpg",
    "architect": "C.B. Macdonald/Robert Trent Jones Sr.",
    "year_built": 1921,
    "description": "This island course is known for its world-famous Cape 5th hole, which doglegs left around Mangrove Lake. Drone shots flatten out just how high above the lake the tee really is — 50 feet (!) — and the thrill never wanes of selecting the correct line over the lake as you factor in the day’s wind. Another standout template hole is the Redan 17th with its angled green framed by the azure blue water in the background. The golf lacks nothing as the course rotates from cliffs to hilly interior holes to the finisher back along the cliffs with the pink clubhouse high on the hill. Max fee: $275 (Photo: Courtesy Mid Ocean Club)",
    "detailed_location": {
      "address": "1 Mid Ocean Drive, St.George's, Bermuda",
      "lat": 32.3309722,
      "lng": -64.6938583
    }
  },
  {
    "rank": 33,
    "course_name": "Sand Hollow (Championship)",
    "city": "Hurricane",
    "state": "UT",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/sandhollow.jpg",
    "architect": "John Fought/Andrew Staples",
    "year_built": 2008,
    "description": "Out amid the red rocks of southern Utah, a camera is almost as vital your clubs. Against this National Geographic backdrop, Sand Hollow cuts a photogenic path, its holes specked with spiky desert vegetation and red-sand bunkers that complement their ruddy, stone surrounds. While the front nine is eye-catching, the back nine almost needs to be seen to be believed. Carved along the ridges of a lands-end plateau, it flows from one catch-your-breath vista to another. Aim and swing, then point and shoot. Max fee: $230 (Photo: Brian Oar)",
    "detailed_location": {
      "address": "5662 West Clubhouse Drive, Hurricane, UT 84737, USA",
      "lat": 37.11453059999999,
      "lng": -113.4144024
    }
  },
  {
    "rank": 34,
    "course_name": "Forest Dunes (Loop: Red/Black)",
    "city": "Roscommon",
    "state": "MI",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/forestdunes.jpg",
    "architect": "Tom Doak",
    "year_built": 2016,
    "description": "This reversible course was the brainchild of Tom Doak, who had always wanted to build such a course if a suitable opportunity presented itself. The natural landforms here are sufficiently muted so that greens could be approached in both directions with an emphasis squarely on the ground game. Doak has long deplored unnecessary framing and mounding around greens, so going without was no chore. Whatever you do, stay overnight so you can experience the holes in the opposite direction the next day. Whether the clockwise or counterclockwise routing is better is up for debate as both are laced with memorable holes. Max fee: $165, resort guests; $185, non-resort guests (Photo: Brian Oar)",
    "detailed_location": {
      "address": "6376 Forest Dunes Dr, Roscommon, MI 48653, USA",
      "lat": 44.5918048,
      "lng": -84.5295088
    }
  },
  {
    "rank": 35,
    "course_name": "Tobacco Road",
    "city": "Sanford",
    "state": "NC",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Tobacco-road-scaled.jpg",
    "architect": "Mike Strantz",
    "year_built": 1998,
    "description": "If all courses looked and played the same, the game would have squandered its greatest advantage. Thankfully, every now and then, an architect like Mike Strantz comes along with his own out-of-the-box vision as to what constitutes good golf. At Tobacco Road, in-your-face hazards, blind shots, and imaginative green contours fuel what amounts to a thrill ride. This visual feast unsettles some and emboldens others — and that’s its beauty. Options abound, be it going for the 4th or 11th greens in two or taking the left fairway option on the 5th and trying to scoot a drive up to the green. One round won’t suffice as you debate your own successes and failures afterward. Max fee: $215 (Photo: Kevin Murray)",
    "detailed_location": {
      "address": "Tobacco Rd, North Carolina 27332, USA",
      "lat": 35.3949041,
      "lng": -79.2171664
    }
  },
  {
    "rank": 36,
    "course_name": "Wilderness Club",
    "city": "Eureka",
    "state": "MT",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/WildernessClub.jpg",
    "architect": "Nick Faldo/Brian Curley",
    "year_built": 2008,
    "description": "Little dirt was moved to craft this lilting layout, which meanders around meadows and alpine lakes while gliding in and out of the dappled shade of stately Ponderosa pines. The ruggedness of the environs is mirrored by the naturalness of sandy wastes and bunkers, which give way seamlessly to native grasses and green complexes of eclectic shape and size. While snow-capped peaks create pulse-pounding vistas in the near distance, the course itself has only gentle shifts in elevation that make it a friendly hike. Max fee: $139 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "1885 Sophie Lake Rd, Eureka, MT 59917, USA",
      "lat": 48.9279899,
      "lng": -115.1219635
    }
  },
  {
    "rank": 37,
    "course_name": "Chambers Bay",
    "city": "University Place",
    "state": "WA",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/chambersbay.jpg",
    "architect": "Robert Trent Jones Jr.",
    "year_built": 2007,
    "description": "Robert Jones Jr., with the on-site help of Bruce Charlton and Jay Blasi, created a superb addition to the Pacific Northwest landscape. Previously, the best-known courses in the area featured soaring fir and other distinctive hardwoods. Chambers Bay brought scale and width to the region, with stunning long views in all directions. The stretch from 13 through 17 is the stuff of dreams with its requirements alternating between power and finesse. Recently re-grassed, the firm playing conditions allow the design to play as well as it photographs. Max fee: $240 (Photo: Brian Oar)",
    "detailed_location": {
      "address": "Chambers Bay Golf Course, 6320 Grandview Dr W, University Place, WA 98467, USA",
      "lat": 47.2003276,
      "lng": -122.5707511
    }
  },
  {
    "rank": 38,
    "course_name": "Blackwolf Run (River)",
    "city": "Kohler",
    "state": "WI",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/blackwolf-scaled.jpg",
    "architect": "Pete Dye",
    "year_built": 1988,
    "description": "Whistling Straits with its two miles of frontage along Lake Michigan captures the eye but this inland Dye course has nearly as many ardent supporters. Built a decade before Whistling, the River course occupies one of the best wooded parcels that Dye was ever given. Scenic hills, a meandering creek and an owner who devoted it all to golf paved the way for Dye to create one of his most challenging tests. Among the highlights: angled greens set on plateaus (such as No. 5), short par-4s that infuriate (No. 9) and risk-reward par-5s (No. 16). Most exasperating of all for players who hit a fade might be the one-shot 13th, which plays over a bend in the river with trees uncomfortably hanging out from the left. If there is such a thing as an underrated Dye course, this is it. Max fee: $330 (Photo: Courtesy Kohler Co.)",
    "detailed_location": {
      "address": "1111 W Riverside Dr, Kohler, WI 53044, USA",
      "lat": 43.726896,
      "lng": -87.77588399999999
    }
  },
  {
    "rank": 39,
    "course_name": "Streamsong (Black)",
    "city": "Bowling Green",
    "state": "FL",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/streamsong-scaled.jpg",
    "architect": "Gil Hanse",
    "year_built": 2017,
    "description": "Like its Streamsong siblings, the Blue and Red courses, this rollicking design gambols through a most un-Florida-like landscape: the white dunes of a former phosphate mine. What sets it apart (aside from its location, a mile south of the other two) is its scale, with large, mounded greens, and fairways as wide as landing strips. Despite its size, the course asks subtle questions in the form of blind shots, cleverly placed bunkers and quirky contours that require the most of your imagination. Call it modern minimalism, taken to the max. Max fee: $259, resort guest; $259, non-resort guest (Photo: Will Watt)",
    "detailed_location": {
      "address": "Bowling Green, FL 33834, USA",
      "lat": 27.6699597,
      "lng": -81.92773079999999
    }
  },
  {
    "rank": 40,
    "course_name": "Kapalua Resort (Plantation)",
    "city": "Lahaina",
    "state": "HI",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/KapPlantation_18B_11-19_HighResolution-1.jpg",
    "architect": "Bill Coore/Ben Crenshaw",
    "year_built": 1991,
    "description": "Is great architecture being given great property like Sand Hills and not screwing it up, or is it being given a difficult site and making a series of compelling holes? The answer is both, and this course is an example of the latter. Set on the side of a mountain, this property could have easily produced a series of awkward holes that fought the land. Instead, this early Coore & Crenshaw design showed the promise and skill that the duo would bring to every project over the ensuing 30 years. Especially memorable are 17 and 18 with their greens that fall from front right to back left. When the PGA Tour comes here in January, the Plantation course reliably produces some of the most inedible shots of the season. Max fee: $360 (Photo: Dave Sansom)",
    "detailed_location": {
      "address": "2000 Plantation Club Dr, Lahaina, HI 96761, USA",
      "lat": 21.0070838,
      "lng": -156.6403278
    }
  },
  {
    "rank": 41,
    "course_name": "Mid Pines",
    "city": "Southern Pines",
    "state": "NC",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Mid-Pines1-4.jpg",
    "architect": "Donald Ross",
    "year_built": 1921,
    "description": "Set on a contiguous block of property, this tightly knit Donald Ross has been wooing fans ever since Kyle Franz worked his restoration magic in 2013. The sandscapes that he exposed and created are gorgeous, and combined with the original Ross green contours, have design aficionados wagging their tongues. Distinctive features include the slender, angled greens at 4 and 12, and the compelling finishing stretch from 15 through 18 guarantees this to be a Sandhills favorite. Max fee: $215 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "1010 Midland Rd, Southern Pines, NC 28387, USA",
      "lat": 35.1932861,
      "lng": -79.3921644
    }
  },
  {
    "rank": 42,
    "course_name": "Omni Homestead (Cascades)",
    "city": "Hot Springs",
    "state": "VA",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Lynn-Swann-20180828A0130h.jpg",
    "architect": "William S. Flynn",
    "year_built": 1923,
    "description": "Tillinghast actually turned down this project, thinking there wasn’t enough room to build good holes in the narrow valley floor. That speaks volumes about William Flynn and his ability to find solutions to tricky problems. The course famously finishes 3-5-5-3 but the entire back nine captures the allure of valley golf. The long 12th, with a creek down the left, has long been regarded as one of Virginia’s finest holes. Arnold Palmer named the dogleg right par-4 10th, which stair-steps downhill, as one of his 54 favorite holes in America. Max fee: $200 (Photo: Lynn Swann)",
    "detailed_location": {
      "address": "7696 Sam Snead Hwy, Hot Springs, VA 24445, USA",
      "lat": 37.997336,
      "lng": -79.830827
    }
  },
  {
    "rank": 43,
    "course_name": "Mossy Oak",
    "city": "West Point",
    "state": "MS",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/MossyOakGolfClub1-64.jpg",
    "architect": "Gil Hanse",
    "year_built": 2016,
    "description": "On the site of a former dairy farm, Gil Hanse whipped up tempting short par-4s, some nearly blind tee shots and plenty of deceptive bunkering (although you can’t miss the massive one left of the par-5 17th green). The rolling terrain and wide open space is easily walkable, and the firm, fast turf can lead to extra yards or leave you with a poor angle in to the greens, many of which are complicated by serious contours and false fronts. Check out the panoramic view from the elevated 6th green, where you can take in just about all of Mossy Point. Max fee: $180 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "5781 US-45 ALT, West Point, MS 39773, USA",
      "lat": 33.590531,
      "lng": -88.66202930000001
    }
  },
  {
    "rank": 44,
    "course_name": "Pine Needles",
    "city": "Southern Pines",
    "state": "NC",
    "img_url": "https://golf.com/wp-content/uploads/2021/05/pine-needles.jpg",
    "architect": "Donald Ross",
    "year_built": 1927,
    "description": "More famous — and expansive — than its sister course, Mid Pines, by virtue of having hosted three U.S. Women’s Opens (with a fourth coming in 2022), Pine Needles originally was intended to be a housing course. But those plans never fully materialized as the course opened just before the Great Depression. Still, Ross fanned the holes out in every direction and draped the fairways with great creativity across the rolling landscape. Pine Needles’ collection of par-4s is especially sturdy. The winning scores here are never far from par as birdie options are scarce. Expect to see the false sides and fronts on the greens — like at 1,7 and 18 — give the women fits in 2022. Max fee: $245 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "1005 Midland Rd, Southern Pines, NC 28387, USA",
      "lat": 35.197113,
      "lng": -79.3923492
    }
  },
  {
    "rank": 45,
    "course_name": "May River (Palmetto Bluff)",
    "city": "Bluffton",
    "state": "SC",
    "img_url": "https://golf.com/wp-content/uploads/2021/05/may-river.jpg",
    "architect": "Jack Nicklaus",
    "year_built": 2004,
    "description": "This graceful design captures the allure of Lowcountry golf. Many of the features are glued to the ground as the course meanders across the property. On some holes, like at the par-3 2nd, the wetland is well short of the green; on others, such as at the dangerous short par-4 7th, the hazard is flush against the putting surface. At the par-5 15th, a pair of Spectacle bunkers hide the long approach to the green, creating a sense of mystery. Holes 13 and 14 ooze charm and embody the sort of golf that you would like to play every day. Max fee: $320 (Photo: Tim Zielenbach)",
    "detailed_location": {
      "address": "350 Mt Pelia Rd, Bluffton, SC 29910, USA",
      "lat": 32.2108677,
      "lng": -80.8857008
    }
  },
  {
    "rank": 46,
    "course_name": "Arcadia Bluffs (Bluffs)",
    "city": "Arcadia",
    "state": "MI",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/ArcadiaBluffs-7_10-295_H5.jpg",
    "architect": "Warren Henderson/Rick Smith",
    "year_built": 1999,
    "description": "What Whistling Straits is to Wisconsin, Arcadia Bluffs is to the Wolverine state: an artful feat of engineering, along the shores of Lake Michigan. From a commanding panoramic atop the bluffs, the course swoops down and along the water through some 200 feet of elevation change, its ample fairways flanked by rambunctious mounding and sod-wall bunkers. Greens are large, and the landscape itself, though manufactured, feels natural in its movement. Thanks to recent rerouting of several holes, each nine now returns to the clubhouse, with dramatic highlights spread more evenly throughout the round. Max fee: $220 (Photo: Courtesy)",
    "detailed_location": {
      "address": "14710 Northwood Hwy, Arcadia, MI 49613, USA",
      "lat": 44.456655,
      "lng": -86.24252
    }
  },
  {
    "rank": 47,
    "course_name": "Rustic Canyon",
    "city": "Moorpark",
    "state": "CA",
    "img_url": "https://golf.com/wp-content/uploads/2021/05/rustic.jpg",
    "architect": "Gil Hanse/Geoff Shackelford/Jim Wagner",
    "year_built": 2002,
    "description": "George Thomas, who worked magic in a canyon when building Riviera, is a hero to Rustic Canyon’s designers. Here, about an hour’s drive (traffic dependent!) north of Riviera, Gil Hanse, Jim Wagner, and Geoff Shackelford conjured a design that would have impressed even Thomas. The imaginative use of washes throughout and the horseshoe 13th green are but a few of the challenges. Aerial views highlight how peacefully the holes occupy the valley floor, and the course enjoys a legion of fans who prefer minimalism. Hard to find a better bang for the buck west of the Rockies. Max fee: $69 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "15100 Happy Camp Canyon Rd, Moorpark, CA 93021, USA",
      "lat": 34.3119008,
      "lng": -118.867463
    }
  },
  {
    "rank": 48,
    "course_name": "Karsten Creek",
    "city": "Stillwater",
    "state": "OK",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/untitled-9510.jpg",
    "architect": "Tom Fazio",
    "year_built": 1994,
    "description": "Numerous Oklahoma State alums turned PGA Tour stars (like Rickie Fowler, Viktor Hovland and Matthew Wolff, among others) played and practiced on this Tom Fazio design, the Cowboys home course set 10 miles west of campus. It’s a tough test with an especially taxing finish where Lake Louise comes into play on the closing two holes; tee shots on both the par-4 17th and the dogleg-left par-5 finale must carry the water and avoid it up the left side of the hole. There are few bunkers but no shortage of ball-swallowing trees lining the fairways. Max fee: $400 (Photo: Mike Klemme)",
    "detailed_location": {
      "address": "1800 Memorial Dr, Stillwater, OK 74074, USA",
      "lat": 36.1026039,
      "lng": -97.185501
    }
  },
  {
    "rank": 49,
    "course_name": "Wild Horse",
    "city": "Gothenburg",
    "state": "NE",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/DSC_2540.jpg",
    "architect": "Dave Axland/Dan Proctor",
    "year_built": 1999,
    "description": "The Sand Hills of Nebraska are best known to golf buffs for a high-ranked private club of the same name. This is the Everyman’s equivalent. For less than what a caddie costs at its exclusive counterpart, Wild Horse offers a kindred golf experience, with firm, fast fairways and rough-lipped bunkers gouged out of the rolling terrain. While the big skies and open spaces are pure prairie, the bouncy conditions and wind-whipped native grasses create the look and feel of a course across the pond. Think links golf, minus the sea. Max fee: $62 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "40950 Rd 768, Gothenburg, NE 69138, USA",
      "lat": 40.9546548,
      "lng": -100.1898032
    }
  },
  {
    "rank": 50,
    "course_name": "Sea Island (Seaside)",
    "city": "St Simons Island",
    "state": "GA",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Sea-Island-Seaside13_6583548-.jpg",
    "architect": "Harry S. Colt/Charles Alison",
    "year_built": 1929,
    "description": "PGA Tour viewers will be familiar with this design, as it has played host to the RSM Classic since 2010. Tom Fazio stitched together two existing nines (the original Seaside nine was the handiwork of Englishmen Harry Colt and Charles Alison back in 1929) and conjured a memorable routing featuring marshland, Atlantic winds and elevated greens. The dogleg-left 13th is the most talked about hole, protected on the left by marshland and on the right by three fairway bunkers, plus a tricky approach to a raised green. Max fee: tee times accessible with resort lodging reservation (Photo: Evan Schiller)",
    "detailed_location": {
      "address": "Sea Island, Georgia, USA",
      "lat": 31.2017278,
      "lng": -81.33169029999999
    }
  },
  {
    "rank": 51,
    "course_name": "The Greenbrier (Old White)",
    "city": "White Sulphur Springs",
    "state": "WV",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/OldWhite18.jpg",
    "architect": "C.B. Macdonald",
    "year_built": 1913,
    "description": "Regrettably, the Macdonald school of architecture is largely confined to America’s toniest private clubs, meaning too few golfers get to experience C.B. Macdonald’s special brand of strategic design. This course, built in 1913, is a rare exception. After restoration work performed first by Lester George and then Keith Foster, many of Macdonald’s favorite template holes are once again present. Among the best are the Redan 8th and Narrows 14th. Max fee: $495 (Photo: Courtesy)",
    "detailed_location": {
      "address": "101 W Main St, White Sulphur Springs, WV 24986, USA",
      "lat": 37.7860374,
      "lng": -80.30795979999999
    }
  },
  {
    "rank": 52,
    "course_name": "We-Ko-Pa (Saguaro)",
    "city": "Fort McDowell",
    "state": "AZ",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/we-ko-pa.jpg",
    "architect": "Bill Coore/Ben Crenshaw",
    "year_built": 2006,
    "description": "Coore & Crenshaw have two desert courses in our Top 100 You Can Play: Talking Stick (No. 82) and We-Ko-Pa, both of which are on Indian reservations. We-Ko-Pa features great topographic interest. The fairways bleed into the desert floor, signifying how they are at grade with their surrounds. Steer well clear of the insidious little scar bunker that eats into the green at the short par-4 10th; if you find it, you could find yourself hitting out sideways or backward. From that claustrophobic hazard to the expansive views from the elevated tees at 15 of the distant Verde River and Superstition Mountains, We-Ko-Pa offers great variety. Max: $265 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "18200 Wekopa Way, Fort McDowell, AZ 85264, USA",
      "lat": 33.5852778,
      "lng": -111.6891667
    }
  },
  {
    "rank": 53,
    "course_name": "The Dunes",
    "city": "Myrtle Beach",
    "state": "SC",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/the-dunes.jpg",
    "architect": "Robert Trent Jones Sr.",
    "year_built": 1948,
    "description": "Before World War II, Robert Trent Jones Sr. worked for the legendary Canadian architect, Stanley Thompson. Jones’s early solo works, especially at Peachtree and here at The Dunes, show a similar design flair to that which made the Toronto Terror so famous. The second nine is anchored by the iconic par-5 13th that sweeps around the lake. Indeed, many consider the second nine one of the finest in the Palmetto State. But the first nine is nearly as good, with the dogleg 2nd and 4th holes favoring perfect draws off each tee and the green at the one-shot 9th affords the best view of the Atlantic Ocean. For more than 50 years, the Golf Writers Association of America were smart enough to convene here the week before the Masters. Max fee: $277 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "The Dunes, Myrtle Beach, SC 29572, USA",
      "lat": 33.7607279,
      "lng": -78.8025222
    }
  },
  {
    "rank": 54,
    "course_name": "Ozarks National at Big Cedar Lodge",
    "city": "Hollister",
    "state": "MO",
    "img_url": "https://golf.com/wp-content/uploads/2021/05/ozarks.jpg",
    "architect": "Bill Coore/Ben Crenshaw",
    "year_built": 2019,
    "description": "One of five big-name courses at Big Cedar Lodge, the wilderness resort built by Bass Pro Shops founder Johnny Morris, Ozarks National served as a change of scenery for Coore and Crenshaw. Known for their minimalist work in sand, the duo here brought their light hands to a landscape of dramatic limestone ridges, giving way to views of the surrounding hills. While the medium is different, the artistry is familiar, on a course that moves in harmony with the terrain. Not that the designers are opposed to manmade touches. Consider, for instance, the 400-foot beam and blank bridge, which spans from tee to fairway on the 13th hole, crossing over a fast-flowing creek. Max fee: $250 (Photo: Evan Schiller)",
    "detailed_location": {
      "address": "1250 Golf Club Dr, Hollister, MO 65672, USA",
      "lat": 36.5612035,
      "lng": -93.1968445
    }
  },
  {
    "rank": 55,
    "course_name": "Mauna Kea",
    "city": "Waimea",
    "state": "HI",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/mauna-kea.jpg",
    "architect": "Robert Trent Jones Sr.",
    "year_built": 1965,
    "description": "There was golf in Hawaii well before Mauna Kea debuted on the Big Island in 1965, but this dazzling Robert Trent Jones Sr. design took the destination’s offerings to the next level. His work here includes an all-time photo op: the par-3 3rd and its daunting carry over the Pacific to a distant green ringed with bunkers. The 7,370-yard design also features some serious elevation changes, especially on the 250-yard 11th, which drops 100 feet from tee to green with a stunning ocean backdrop. Among the challenges are uneven lies, sharp doglegs and elevated greens. Arnold Palmer and Jack Nicklaus set the back-nine record of 31 during a course-opening exhibition in late 1964. Max fee: $295 (Photo: Evan Schiller)",
    "detailed_location": {
      "address": "Mauna Kea Resort, 62-100 Kaunaʻoa Dr, Waimea, HI 96743, USA",
      "lat": 19.996631,
      "lng": -155.825008
    }
  },
  {
    "rank": 56,
    "course_name": "Arcadia Bluffs (South)",
    "city": "Arcadia",
    "state": "MI",
    "img_url": "https://golf.com/wp-content/uploads/2021/05/arcadia-scaled.jpg",
    "architect": "Dana Fry",
    "year_built": 2018,
    "description": "Ever see a square green? It’s a rare but cool architectural quirk that Dana Fry introduces on the 1st hole on the newbie South course and repeats numerous times throughout; other defining features include narrow cross-bunkers and spacious fairways on an essentially treeless site. It’s a bit like stepping back in time even though the course debuted just three years ago. You’ll be helped and hurt by breezes blowing off Lake Michigan just to the west, with firm and fast conditions emphasizing the ground game. The longest par-4 (the 491-yard 4th) is also the toughest despite heading downhill. On the two par-3s (the 5th and 12th), long is better than short, or else your ball will trundle backward off steep false fronts. Enjoy the panoramic view from the 15th tee. Max fee: $220 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "13637 Northwood Hwy, Bear Lake, MI 49614, USA",
      "lat": 44.4360096,
      "lng": -86.2139076
    }
  },
  {
    "rank": 57,
    "course_name": "French Lick (Ross Course)",
    "city": "French Lick",
    "state": "IN",
    "img_url": "https://golf.com/wp-content/uploads/2021/05/Don-Ross-Hole-4-C_2-scaled.jpg",
    "architect": "Donald Ross",
    "year_built": 1917,
    "description": "To say that both the property and the greens are rolling is an understatement! Whatever preconceived notions you might have about Donald Ross greens, they will be blown out of the water with one tour around this 1917 design, which was deemed such a good test that it quickly hosted the 1924 PGA Championship. The 8th green, with its six feet of fall from back to front, gets most of the attention, but a green like 17 that drops more than three feet from its high right plateau to a lower left tier is just as astonishing. Three of the par-3s measure 240, 250 and 250 yards and may well constitute Ross’s most bruising collection of one-shotters. Max fee: $125 (Photo: Brian Walters)",
    "detailed_location": {
      "address": "11160 IN-56, French Lick, IN 47432, USA",
      "lat": 38.5284881,
      "lng": -86.648056
    }
  },
  {
    "rank": 58,
    "course_name": "The Broadmoor (East)",
    "city": "Colorado Springs",
    "state": "CO",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/broadmoor.jpg",
    "architect": "Donald Ross, Robert Trent Jones Sr. (1952)",
    "year_built": 1919,
    "description": "When it opened in 1918, at 6,400 feet above sea level, this was highest course in the United States. And though other layouts have since surpassed it in elevation, the property still sits in rarefied air. Broadmoor’s historic grounds were the site of Jack Nicklaus’s victory in the 1959 U.S. Amateur, as well as the first of Annika Sorenstam’s 10 major wins. In 1948, Robert Trent Jones Sr. added a new nine to Broadmoor East, but the course remains a showcase of Golden Age features, including many of Ross’s original confounding greens. Max fee: $290 (Photo: Courtesy)",
    "detailed_location": {
      "address": "1 Lake Ave, Colorado Springs, CO 80906, USA",
      "lat": 38.7910791,
      "lng": -104.8499124
    }
  },
  {
    "rank": 59,
    "course_name": "George Wright",
    "city": "Boston",
    "state": "MA",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/george-wright.jpg",
    "architect": "Donald Ross",
    "year_built": 1936,
    "description": "A WPA project in the late 1930s, this course thankfully came deep in Ross’s career, because it is hard to fathom that he would have had the ability to design so many outstanding holes on this rocky site if he had just arrived from Scotland where all he knew was sandy soil. Fast-forward 35-plus years, though, and Ross and his team, led by Walter Hatch, had developed the skill set to employ dynamite to render holes that make the site look as if it was always meant for golf. Standout stretches of par-4s include 5 though 7, as well as 10 through 12. With no weak links, this municipal course is better than most of the private courses in golf-rich Massachusetts. Max fee: $57 (Photo: Courtesy)",
    "detailed_location": {
      "address": "420 West St, Hyde Park, MA 02136, USA",
      "lat": 42.2684323,
      "lng": -71.13279709999999
    }
  },
  {
    "rank": 60,
    "course_name": "Silvies Valley Ranch (Craddock/Hankins)",
    "city": "Seneca",
    "state": "OR",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/silvies-valley-ranch.jpg",
    "architect": "Dan Hixson",
    "year_built": 2017,
    "description": "Golfers won’t trek all the way to eastern Oregon for just any old course, which is why Silvies Valley Ranch ownership agreed to architect Dan Hixson’s novel idea for a reversible layout. One day, it’s the Craddock course, the next day it’s the Hankins. Here’s the math: 36 holes, 27 greens and 16 spacious fairways. Serious elevation changes will have you frequently reaching for your rangefinder; you’ll also need to allow for the altitude: the high desert landscape is almost 5,000 feet above sea level. The 18th on the Hankins drops 100 feet from tee to fairway, with mounding that helps provide a bit more roll. Max fee: $160 (Photo:  Brian Oar)",
    "detailed_location": {
      "address": "40000 East Cowboy Lane, Seneca, OR 97873, USA",
      "lat": 44.0400312,
      "lng": -118.9761699
    }
  },
  {
    "rank": 61,
    "course_name": "Wine Valley",
    "city": "Walla Walla",
    "state": "WA",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/wine-valley.jpg",
    "architect": "Dan Hixson",
    "year_built": 2009,
    "description": "Even more surprising than learning this slice of southeastern Washington is a premier wine producing region is discovering a superb course just west of downtown Walla Walla, not far from the Oregon border. The Blue Mountains serve as a mesmerizing backdrop for this Dan Hixson design, where the bunker styling is similar to what you’ll find on the great links of Scotland and Ireland. Wide open fairways can be buffeted by the wind, so stay low to go low. The challenge of the par-4 5th is eased somewhat by a generously sized green but watch out for the wash in play on the entire hole. Max fee: $175 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "Wine Valley Golf Club, 176 Wine Valley Road, Walla Walla, WA 99362, USA",
      "lat": 46.0594931,
      "lng": -118.4967873
    }
  },
  {
    "rank": 62,
    "course_name": "Taconic",
    "city": "Williamstown",
    "state": "MA",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/taconic.jpg",
    "architect": "Stiles and Van Kleek, Gil Hanse",
    "year_built": 1928,
    "description": "Home to the Williams College golf team, this charming New England course has seen many fine players come through, including Jack Nicklaus, who as an amateur aced the 14th. A hole-in-one is useful on these Wayne Stiles-designed greens, because it eliminates the chance of three-putting, which is the real peril on surfaces that are often perched on high spots around the property. A Gil Hanse restoration shows the importance that the club places in presenting its course in a first-rate manner, and a distant church steeple completes the idyllic New England setting. Max fee: $160 (Photo: Courtesy)",
    "detailed_location": {
      "address": "19 Meacham St, Williamstown, MA 01267, USA",
      "lat": 42.7057243,
      "lng": -73.2017181
    }
  },
  {
    "rank": 63,
    "course_name": "Challenge at Manele Bay",
    "city": "Lanai City",
    "state": "HI",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/challenege-manele-bay.jpg",
    "architect": "Jack Nicklaus",
    "year_built": 1993,
    "description": "Mind-blowing scenery overwhelms the golf on this Lanai stunner, where’ll you take as many pictures as shots. Perhaps best known for the stunning 202-yard par-3 12th, where the tee (upon which Bill and Melinda Gates were married in 1994) and green are separated by vertical cliff faces and the waves of Hulopo’e Bay lapping 150 feet below. The design is a roller coaster ride through black lava outcroppings high above the Pacific. Infinity-edged greens and endless panoramic views will leave you shaking your head in awe of the beauty. Max fee: $325 (Photo: Courtesy)",
    "detailed_location": {
      "address": "One Challenge Dr, Lanai City, HI 96763, USA",
      "lat": 20.7410488,
      "lng": -156.9038696
    }
  },
  {
    "rank": 64,
    "course_name": "Cape Arundel",
    "city": "Kennebunkport",
    "state": "ME",
    "img_url": "https://golf.com/wp-content/uploads/2021/05/capearundel.jpg",
    "architect": "Walter Travis",
    "year_built": 1920,
    "description": "At just less than 6,000 yards, this is the shortest course to make our list; the Bush family was famous for their two-hour rounds here. If you think that means that the design must therefore have perfectly placed hazards, superb greens and excellent over all presentation, you would be correct. Arguably, the two architects most accomplished at building great contours on medium size greens were Perry Maxwell and Walter Travis. Cape Arundel is the only course on our list from both of these design titans, so don’t miss out. Max fee: $125 (Photo: Courtesy)",
    "detailed_location": {
      "address": "Cape Arundel, Kennebunkport, ME 04046, USA",
      "lat": 43.3403642,
      "lng": -70.4661622
    }
  },
  {
    "rank": 65,
    "course_name": "Marquette (Greywalls)",
    "city": "Marquette",
    "state": "MI",
    "img_url": "https://golf.com/wp-content/uploads/2021/05/grey.jpg",
    "architect": "Mike Devries",
    "year_built": 2005,
    "description": "Some say Michigan’s Upper Peninsula is a world unto itself, and after crossing the Mackinaw Bridge, you’ll quickly see why “Yoopers” love this part of the state. From the “border” crossing, it’s a three-hour, well-worth-the-drive journey to Greywalls. Rugged beauty is an understatement on this DeVries design, where he somehow managed to carve out a memorable layout though granite outcroppings; the course’s namesake comes into play on several holes, most notably the par-3 6th. The woodsy setting has plenty of ups and downs, plus breathtaking views of nearby Lake Superior, especially from the elevated opening tee. Forget the scorecard and enjoy the ride. Max fee: $130 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "1075 Grove St, Marquette, MI 49855, USA",
      "lat": 46.5336581,
      "lng": -87.4238937
    }
  },
  {
    "rank": 66,
    "course_name": "Bethpage (Red)",
    "city": "Farmingdale",
    "state": "NY",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Bethpage-Red-6591-copy.jpg",
    "architect": "A.W. Tillinghast",
    "year_built": 1936,
    "description": "The Black Course casts such a long, daunting shadow, it’s amazing any grass can grow on its four sibling courses at Bethpage State Park. But it does, especially on the Red Course, which more than holds its own, albeit with much less fanfare than its fellow A.W. Tillinghast design. There’s no warning sign at the 1st tee like at the Black, the rough is friendlier and the bunkers less dramatic (except for the fistful that split the fairway on the par-4 13th). But locals know none of that makes the Red a pushover. You’ll get the message right away with the uphill approach on the opener, followed by a series of doglegs, both sharp and soft, that will force you to hit every club — and shot — in your bag. Max fee: $96 (Photo: Long Island State Parks)",
    "detailed_location": {
      "address": "Unnamed Road, Farmingdale, NY 11735, USA",
      "lat": 40.7428943,
      "lng": -73.45623499999999
    }
  },
  {
    "rank": 67,
    "course_name": "PGA West (TPC Stadium)",
    "city": "La Quinta",
    "state": "CA",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/PGA-West-TPC-Stadium.jpg",
    "architect": "Pete Dye",
    "year_built": 1986,
    "description": "The course that was so tough the pros asked that it be taken off the course rotation for the old Bob Hope Classic can still bring the hurt. Seemingly bottomless bunkers, acres of water hazards and uneven lies can leave your head spinning. The PGA Tour returned here in 2016, and it’s always cool to play a course you can watch on TV. Your chance for immortality comes on the par-3 17th, with its island green upon which Lee Trevino made an ace during the 1987 Skins Game. The par-4 18th, with water up the left side, was the scene of many broken dreams when the PGA Tour’s Qualifying School finals were played here. Max fee: $279 (Photo: Evan Schiller)",
    "detailed_location": {
      "address": "56150 Pga Blvd, La Quinta, CA 92253, USA",
      "lat": 33.6416915,
      "lng": -116.2587036
    }
  },
  {
    "rank": 68,
    "course_name": "Giant's Ridge (Quarry)",
    "city": "Biwabik",
    "state": "MN",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Giants-Ridge-Quarry.jpg",
    "architect": "Jeff Brauer",
    "year_built": 2003,
    "description": "Add a pinch of Pine Valley vibe with a splash of Irish links magic on top of a former sand, gravel and iron ore mining site and you get The Quarry at Giant’s Ridge. Tucked away in northern Minnesota (three hours north of Minneapolis), the Jeff Breuer design offers a beguiling mix of par-4s, including the 13th, where you can go for the elevated green (anywhere from 239 yards to 323 yards away) or lay back for a wedge approach. Then there’s the 9th, framed by a chute of tall dunes off the tee followed by an uphill shot to the green. Invest in a yardage book both for the numbers — and for details on former mining operations in the area. Max fee: $109 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "5893 Giants Ridge Rd, Biwabik, MN 55708, USA",
      "lat": 47.540606,
      "lng": -92.28901669999999
    }
  },
  {
    "rank": 69,
    "course_name": "Cove Club at Cabo del Sol",
    "city": "Cabo San Lucas",
    "state": "B.C.S.",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Cove-Club-Cabo-del-Sol.jpg",
    "architect": "Jack Nicklaus",
    "year_built": 1994,
    "description": "Opened in 1996, the Cove Club was immediately hailed as a world top 100 course, in part because of its dazzling four-hole finish. Now, the course ends on the former 16th, a luscious downhill two-shotter that finishes so close to the Sea of Cortez that the green almost appears to be in the water. Two new holes were built inland and the core of the course remains as strong as ever. As part of the ongoing work, the 5th green has been pushed to edge of the sea as well — be prepared for some salt spray! Max fee: $350 (Photo: Evan Schiller)",
    "detailed_location": {
      "address": "México 1 km 10.3, del Sol, 23410 Cabo San Lucas, B.C.S., Mexico",
      "lat": 22.9152794,
      "lng": -109.8420017
    }
  },
  {
    "rank": 70,
    "course_name": "Warren Course at Notre Dame",
    "city": "Notre Dame",
    "state": "IN",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Warren-Course-Notre-Dame.jpg",
    "architect": "Bill Coore/Ben Crenshaw",
    "year_built": 2000,
    "description": "Notre Dame didn’t always have a golf course that represented the institution’s lofty ideals. It does now after William Warren paved the way for Coore & Crenshaw to build this new course in 1999. Two superlative examples of flat land architecture are found at the 9th and 13th holes. At the 185-yard 9th, a bunker 20 yards short of green fools players into coming up short. Another great bunkering scheme is on the 433-yard 13th, where the fairway breaks sharply left around a pair of bunkers 60 yards shy of the green. The finishing holes descend into more wooded, tumbling land, including the picturesque 16th where you hit over Juday Creek. The course’s many merits were on display at the 2019 U.S. Senior Open. Max fee: $70 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "110, Warren Golf Course Clubhouse, Notre Dame, IN 46556, USA",
      "lat": 41.7095902,
      "lng": -86.2225002
    }
  },
  {
    "rank": 71,
    "course_name": "Twin Dolphin",
    "city": "Cabo San Lucas",
    "state": "B.C.S.",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Twin-Dolphin.jpg",
    "architect": "Fred Couples/Todd Eckenrode",
    "year_built": 2018,
    "description": "“We tried to avoid that bulldozed, clean-edged look,” Eckenrode says of this high-end, lay-of-the-land gem, which spreads gracefully atop a desert bluff, with Sea of Cortez vistas everywhere you turn. Arroyos run in all directions, flanking some holes, crisscrossing others, though forced carries are rare and the broad-shouldered fairways make it hard to lose a ball. The turf is bouncy, like a links, and the ground game requirements add to the fun. This is golf as pleasure not as punishment, a point underscored by the pair of comfort stations you pass along the way, kick-back spots for bracing margaritas and fish tacos, hot off the grill. Though private, the course is accessible to guests of the Montage Los Cabos resort and Montage Residences. Max fee: $450 (Photo: Evan Schiller)",
    "detailed_location": {
      "address": "Carretera Transpeninsular Km. 12.5, Int. Bahia, Playa Santa María, 23450 Cabo San Lucas, B.C.S., Mexico",
      "lat": 22.935576,
      "lng": -109.8270617
    }
  },
  {
    "rank": 72,
    "course_name": "Torrey Pines (South)",
    "city": "La Jolla",
    "state": "CA",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/TorreyPines2.jpg",
    "architect": "William Bell, 1957/Rees Jones, 2001",
    "year_built": 0,
    "description": "Can it be 13 years since Tiger won the U.S. Open here on a broken leg in a playoff against Rocco Mediate? The calendar says yes. It’s unlikely that such high drama will take place again this June when the national championship returns to this cliff-lined stretch of San Diego coast, but you never know. The course has changed slightly since 2008: a handful of new championship tees have been added, the 4th fairway has been moved closer to a bluff overlooking the Pacific and the 15th fairway has been widened. The rough is as juicy as ever, and the pond in front of the 18th green has a magnetic effect on poorly played approaches. Max fee: $252 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "La Jolla, CA 92037, USA",
      "lat": 32.9051983,
      "lng": -117.2447625
    }
  },
  {
    "rank": 73,
    "course_name": "Forest Dunes (Weiskopf)",
    "city": "Roscommon",
    "state": "MI",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Forest-Dunes.jpg",
    "architect": "Tom Weiskopf",
    "year_built": 2002,
    "description": "True to its name, this impeccably kept course toggles between two distinctive settings. From a front nine cut through the soaring conifers of Huron National Forest, the routing opens up onto a back-nine quilt of wispy meadows and sandy wastes that some say evokes Pine Valley. Like the landscape, the challenges are beautiful and varied, perhaps nowhere more than on a rousing three-hole finish composed of a long par-3, a reachable par-4 and a fescue-fringed par-5 that spills through dunes toward a green set hard along a lake. Max fee: $185 (Photo: Brian Oar)",
    "detailed_location": {
      "address": "6376 Forest Dunes Dr, Roscommon, MI 48653, USA",
      "lat": 44.5918048,
      "lng": -84.5295088
    }
  },
  {
    "rank": 74,
    "course_name": "Muskoka Bay",
    "city": "Gravenhurst",
    "state": "ON",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Muskoka-Bay.jpg",
    "architect": "Doug Carrick",
    "year_built": 2007,
    "description": "One of the golf world’s best but least known destinations (outside of Canada, that is) can be found two hours north of Toronto. A favorite vacation destination for Ontario residents, the Muskoka area has some of the country’s best courses, like Muskoka Bay. Doug Carrick incorporated the rocky outcroppings that are part of the Canadian Shield into the layout along with significant elevation changes, which start on the opening hole. Wetlands also come into play, like off the tee on the par 4 9th, where rocks tightly squeeze the opening to an elevated green. The uphill par-5 14th is a beast, and all off the par-3s call for a carry over water. Max fee: $199 (Photo: Julie Medley)",
    "detailed_location": {
      "address": "Muskoka Bay, Gravenhurst, ON, Canada",
      "lat": 44.9339859,
      "lng": -79.3948559
    }
  },
  {
    "rank": 75,
    "course_name": "Trump National Doral (Blue)",
    "city": "Miami",
    "state": "FL",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Trump-Doral.jpg",
    "architect": "Dick Wilson, 1961; Gil Hanse/Jim Wagner, 2013",
    "year_built": 0,
    "description": "Thanks to a preponderance of water, this flat piece of South Florida landscape was dubbed the “Blue Monster.” All of the water remained after a 2014 Gil Hanse renovation, during which he added yardage and shifted bunkers around deftly enough for the course to retain its fearsome moniker. The peninsula green on the par-3 15th quickens heart rates, as does the bruising par-4 closer, which Australian Craig Parry eagled from the fairway to win a PGA Tour event in 2004. Play the angles right and handle the wind correctly, and ghosts from Tour events past might tip their caps in your direction. Max fee: $395 (Photo: Stephen Szurlej)",
    "detailed_location": {
      "address": "4400 NW 87th Ave, Miami, FL 33178, USA",
      "lat": 25.8129673,
      "lng": -80.3387175
    }
  },
  {
    "rank": 76,
    "course_name": "Barona Creek",
    "city": "Lakeside",
    "state": "CA",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Barona-Creek.jpg",
    "architect": "Todd Eckenrode",
    "year_built": 2001,
    "description": "Set into a hillside on tribe-owned land, Barona marks a departure from the tree-lined layouts that proliferate around San Diego. Its footprint is vast and open, with wide, firm fairways that place a premium on taking the right angle of attack. The greens, generously sized with plenty of movement, were re-turfed last year as part of a renovation that also overhauled the bunkers. But for all that’s new, the course looks mature and plays that way, with dry creeks creasing its face and a smattering of gnarled oaks, brought in from nearby, planted strategically here and there. Max fee: $160 (Photo: Courtesy Barona Creek)",
    "detailed_location": {
      "address": "1932 Wildcat Canyon Rd, Lakeside, CA 92040, USA",
      "lat": 32.9406296,
      "lng": -116.8711543
    }
  },
  {
    "rank": 77,
    "course_name": "Four Seasons, Punta Mita (Pacifico)",
    "city": "Nayarit",
    "state": "",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Punta-Mita.jpg",
    "architect": "Jack Nicklaus",
    "year_built": 1999,
    "description": "Listed as hole 3B on the Punta Mita Pacifico scorecard, the Tale of the Whale is an optional par-3 that plays to island green, set amid a natural black-rock formation, some 190-yards of the coast. If your tee shot finds dry land, getting to your ball takes a bit of time as it requires a ride on a motorized dinghy. But no worries. No one is in a rush. Located in what was once a sleepy fishing village, Punta Mita is all tropical tranquility, a sun-splashed resort course with wide, friendly fairways, swaying palm trees and ocean views. Max fee: $265 (Photo: Courtesy of Punta Mita)",
    "detailed_location": {
      "address": "Corral del Risco, Nayarit, Mexico",
      "lat": 20.781032,
      "lng": -105.529223
    }
  },
  {
    "rank": 78,
    "course_name": "RTJ Golf Trail at Grand National (Links)",
    "city": "Opelika",
    "state": "AL",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/RTJ-Grand-National-Links.jpg",
    "architect": "Robert Trent Jones Sr.",
    "year_built": 1992,
    "description": "A nitpicker might point out that “links” is a misnomer, and they’d be right. It’s the wrong term for a course that features sylvan fairways and carries over marshes to soft, receptive greens. But never mind the monikers. The conditioning is pure, the vistas are sublime and the course, the strongest layout on the Robert Trent Jones Trail, is a delightful, varied test. If you time the visit right, you can follow up your round with another top-notch form of outdoor entertainment: the Auburn football stadium is nearby. Max fee: $65 (Photo: rtjgolf.com)",
    "detailed_location": {
      "address": "3000 Robert Trent Jones Trail, Opelika, AL 36801, USA",
      "lat": 32.6747012,
      "lng": -85.4268448
    }
  },
  {
    "rank": 79,
    "course_name": "Bay Hill",
    "city": "Orlando",
    "state": "FL",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/bay-hill-new-1.jpg",
    "architect": "Dick Wilson",
    "year_built": 1961,
    "description": "This original Dick Wilson design will forever be associated with Arnold Palmer, who made it his home course and tinkered with it for more than three decades. Water lurks everywhere, and some of the course's more swashbuckling holes have become even more famous thanks to today’s bombers. The tee shot on the boomerang par-5 6th has become must-watch TV as professionals (most memorably, Bryson DeChambeau) aim nearly at the green on an oblique angle across the lake. No lead is safe in the Arnold Palmer Invitational, and thrilling finishes are commonplace thanks to the easy par-5 16th, killer par-3 17th and daunting 18th with its rock-lined, deep but slender kidney-shaped green. Max Fee: $382 (Photo: Evan Schiller)",
    "detailed_location": {
      "address": "Bay Hill Blvd, Orlando, FL 32819, USA",
      "lat": 28.4584139,
      "lng": -81.5045093
    }
  },
  {
    "rank": 80,
    "course_name": "Omni Bedford Springs Resort (Old Course)",
    "city": "Bedford",
    "state": "PA",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/omni-bedofrd-springs-resort-old-t1ycp.jpg",
    "architect": "Spencer Oldham,1895/A.W. Tillinghast, 1912/Donald Ross, 1923/Ron Forse, 2007",
    "year_built": 1895,
    "description": "Fans of old-school architecture (i.e., you appreciate a “Volcano” par-3, a donut bunker and a tipped-out yardage of just 6,785 yards) will love this design about two hours east of Pittsburgh. The course’s design roots, strengthened by a Ron Forse restoration five years ago, extend back more than a century with multiple Hall of Famers leaving their stamps. Tillie was especially fond of the short par-3 14th (“Tiny Tim”) with distinctive mounding left of the green. It’s one of a fivesome of standout short one-shotters, including the much tougher Volcano at the 4th. Max fee: $169 (Photo: Courtesy of Omni Bedford Springs Resort)",
    "detailed_location": {
      "address": "2138 Business 220, Bedford, PA 15522, USA",
      "lat": 39.9952354,
      "lng": -78.514389
    }
  },
  {
    "rank": 81,
    "course_name": "Royal Blue at Baha Mar",
    "city": "Nassau",
    "state": "",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/royal-blue-baha-mar-t1ycp.jpg",
    "architect": "Jack Nicklaus",
    "year_built": 2017,
    "description": "Across the street from the sprawling Baha Mar resort, this Jekyll-and-Hyde Nicklaus design, on the former site of Cable Beach Golf Club, serves up two distinct nines. The front side demands accuracy, as it winds its way around bunkers and salt-water ponds. The less taxing back nine has wider corridors and imaginative, topsy-turvy fairways framed by limestone outcroppings. The highlight comes at the picturesque 16th, a 165-yard par-3 that plays downhill over water to a peninsula green. “Freeform” tee boxes, some of which extend up to 100 yards, give the course flexibility to make holes look and play differently from one day to the next. Max fee: $360 (Photo: Jim Mandeville/Nicklaus Designs)",
    "detailed_location": {
      "address": "1 Baha Mar Blvd, Nassau, The Bahamas",
      "lat": 25.0705858,
      "lng": -77.3967067
    }
  },
  {
    "rank": 82,
    "course_name": "Talking Stick (O'odham North)",
    "city": "Scottsdale",
    "state": "AZ",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/talking-stick-t1ycp.jpg",
    "architect": "Bill Coore/Ben Crenshaw",
    "year_built": 1999,
    "description": "Subtle and thoughtful designs are the hallmark of Bill Coore and Ben Crenshaw, and the North Course at Talking Stick Golf Club in Scottsdale is no exception. The duo took a flat parcel of desert landscape and built a grassland-fringed layout where the fairways are wide and taking the proper angles is rewarded. This is the antithesis of desert-style target golf. Greens are slightly elevated; miss those and your short game will be tested. Two of the strongest par-4s come early at the 3rd and 4th holes, while the 12th and its fun, split fairway set the tone for the back nine. Best of all is the par-5 2nd with out-of-bounds snug down the left side — it makes golfers do strange things! Max fee: $105 (Photo: Courtesy of Talking Stick Golf Club)",
    "detailed_location": {
      "address": "East Talking Stick Way, 9998 Talking Stick Way, Scottsdale, AZ 85256, USA",
      "lat": 33.5467498,
      "lng": -111.8654265
    }
  },
  {
    "rank": 83,
    "course_name": "Firestone (South)",
    "city": "Akron",
    "state": "OH",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/firestone-south.jpg",
    "architect": "Robert Trent Jones Sr.",
    "year_built": 1969,
    "description": "Don’t care for blind shots or quirky architecture? Want to see what you are doing and have good shots be consistently rewarded? This is the course for you. Water comes into play on just two holes: the par-4 3rd and the endless par-5 16th (667 yards from the tips!). Massive bunkers guard the raised greens and fairways, many of which run parallel to another. Few courses boast more big-time tournament history: the South course has played host to three PGA Championships (most recently in 1975), the WGC-Bridgestone Invitational (won eight times by Tiger between 1999 and 2013) and the current Bridgestone Senior Players Championship. The stallion winners at this frank, well presented examination speak to its high shot qualities. Max fee: $375 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "1245 Firestone Pkwy, Akron, OH 44301, USA",
      "lat": 41.0531134,
      "lng": -81.5287
    }
  },
  {
    "rank": 84,
    "course_name": "Caledonia",
    "city": "Pawleys Island",
    "state": "SC",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/caledonia-t1cycp.jpg",
    "architect": "Mike Strantz",
    "year_built": 1994,
    "description": "The grand arcade of moss-draped oaks that shades the entrance makes a fitting introduction to this Lowcountry idyll, the first solo design by the late Mike Strantz. At just more than 6,500 yards, the course is short in stature but long on character and enjoys a timeless quality. Indeed, this design’s soft-spoken, more conventional features are ideally tailored to the site and are just as appealing as the drama-filled ones that populate many of his subsequent efforts. The routing has a lovely rhythm, its holes ranging in heft from the pint-sized par-3 9th to a stout par-4 18th that plays over water to a green backed by an antebellum clubhouse, where golfers often gather to cheer or jeer their counterparts as they’re coming in. Max fee: $199 (Photo: Brian Oar)",
    "detailed_location": {
      "address": "369 Caledonia Dr, Pawleys Island, SC 29585, USA",
      "lat": 33.4524363,
      "lng": -79.15502699999999
    }
  },
  {
    "rank": 85,
    "course_name": "Pfau Course at Indiana University",
    "city": "Bloomington",
    "state": "IN",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/pfau-course-t1cycp.jpg",
    "architect": "Steve Smyers",
    "year_built": 2020,
    "description": "A bright spot for Midwest golfers last year came in the form of this course opening on IU’s Bloomington campus. Rave reviews quickly followed for a design that features tree-lined fairways on the more secluded front side and a wide-open feel on the back. Named for a major donor to the project, the course can extend to a meaty 7,908 yards (leave that for the college team!), but every green, save the 18th , accepts run-up shots. There are nearly 150 bunkers — the sharp dogleg-right 14th, the shortest par-4 on the course, has 10 alone on the right side of fairway — but architect Steve Smyers gives you a respite on the sand-free par-4 5th and 6th. Max fee: $95 (Photo: Andrew Brown, Indiana University Athletics)",
    "detailed_location": {
      "address": "1492 Indiana 45 46 Bypass, Bloomington, IN 47408, USA",
      "lat": 39.1837622,
      "lng": -86.5100793
    }
  },
  {
    "rank": 86,
    "course_name": "Chileno Bay",
    "city": "Rancho El Tule",
    "state": "Cabo San Lucas, BCS CP",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Chileno-Bay-t1cycp.jpg",
    "architect": "Tom Fazio",
    "year_built": 2014,
    "description": "A former high-end private course that still feels and plays like one, this Tom Fazio stunner offers spectacular elevation changes and sweeping views of the Sea of Cortez. The flatter front nine plays closer to the water before the course climbs into the jagged desert hills. With wide fairways and little rough, Chileno Bay is plenty inviting for average golfers. But don’t be fooled — the strategic options, penal scrub and 145 slope rating from the tips will challenge even the best players. For smart design and pure natural beauty, the pairing of Fazio and Cabo San Lucas is tough to beat. Max fee: $315 (Photo: Courtesy of Chileno Bay)",
    "detailed_location": {
      "address": "Carretera Transpeninsular Km. 15 Rancho, Playa el Tule, Tourist Corridor, 23405 Cabo San Lucas, B.C.S., Mexico",
      "lat": 22.9529786,
      "lng": -109.8036425
    }
  },
  {
    "rank": 87,
    "course_name": "Atlantic City CC",
    "city": "Northfield",
    "state": "NJ",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/atlantic-city-cc-t1cycp.jpg",
    "architect": "Willie Park, 1915/William Flynn, 1925/Tom Doak, 2001",
    "year_built": 1915,
    "description": "The surest bet in Atlantic City opened as a nine-hole layout in 1897, when boardwalk resort owners pooled their funds to build an amenity for their high rollers. In the century-plus since, the course has been modified multiple times by such luminaries as Willie Park Jr., William Flynn, and most recently, Tom Doak, whose late-90s renovation included a rerouting that brought about more intrigue and a smoother flow. The course isn’t overly long or penal. Sporty, fun, and ripe with risk-reward decisions, it’s one of the rare places around these parts where gambling has a chance of paying off. Max fee: $225 (Photo: @premieraerials)",
    "detailed_location": {
      "address": "1 Leo Fraser Dr, Northfield, NJ 08225, USA",
      "lat": 39.37025180000001,
      "lng": -74.5424204
    }
  },
  {
    "rank": 88,
    "course_name": "Reynolds Lake Oconee (Great Waters)",
    "city": "Greensboro",
    "state": "GA",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Reynolds-Lake-Oconee-Great-Waters.jpg",
    "architect": "Jack Nicklaus",
    "year_built": 1992,
    "description": "In the six-course constellation at Reynold Lake Oconee, a luxe development an hour east of Atlanta, this sparkling layout is the brightest star. Refreshed by a 2019 renovation, its routing, laced with rocky creeks and studded with tall pines, gathers momentum on a back nine that makes great strategic use of the lake. The par-3 14th, which plays over water to a green flanked by dogwoods and azaleas, ranks among the standouts of a stretch that is thrilling in its scenery and shot-making demands. Max fee: $300 (Photo: Evan Schiller)",
    "detailed_location": {
      "address": "112 Plantation Dr, Eatonton, GA 31024, USA",
      "lat": 33.3931808,
      "lng": -83.2321319
    }
  },
  {
    "rank": 89,
    "course_name": "Oak Quarry",
    "city": "Riverside",
    "state": "CA",
    "img_url": "https://golf.com/wp-content/uploads/2021/05/oakquarry.jpg",
    "architect": "Gil Morgan/Schmidt-Curley Design",
    "year_built": 2000,
    "description": "Built on the remnants of a dormant rock quarry, this hard-edged beauty seizes on the drama of its surroundings. Sheer walls of white stone serve as backdrop throughout the course, which moves through sizable shifts in elevation. Since no homes encroach, there is nothing to impede the vistas, and little to distract from one of the most striking manmade settings in the game. The par-3 14th hole leaves an especially strong impression. It plays from nosebleed tees over a deep pond to a green framed by a towering quarry wall. Max fee: $172 (Photo: Courtesy Oak Quarry)",
    "detailed_location": {
      "address": "7151 Sierra Ave, Riverside, CA 92509, USA",
      "lat": 34.0284039,
      "lng": -117.4310556
    }
  },
  {
    "rank": 90,
    "course_name": "Puntacana (Corales)",
    "city": "Punta Cana",
    "state": "Dominican Republic",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Puntacana-Corales.jpg",
    "architect": "Tom Fazio",
    "year_built": 2010,
    "description": "Though the Devil’s Elbow doesn’t sound as scary as some other course features named after Lucifer’s anatomy, it’s plenty daunting. The moniker refers to the closing three-hole stretch at this PGA Tour host site, which culminates along the cliffs with a forced carry over the Bay of Corales. It’s a memorable finish to a routing that begins in more conventional fashion, its front nine cut through the flat, inland grounds of the Puntacana Resort. Max fee: $395 (Photo: Evan Schiller)",
    "detailed_location": {
      "address": "Punta Cana 23000, Dominican Republic",
      "lat": 18.565285,
      "lng": -68.339907
    }
  },
  {
    "rank": 91,
    "course_name": "La Quinta Resort (Mountain)",
    "city": "La Quinta",
    "state": "CA",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/top-100-la-quinta.jpg",
    "architect": "Pete Dye",
    "year_built": 1986,
    "description": "This Dye classic is known for scenic mountain views and being more playable than its famous Stadium sibling. But no one leaves La Quinta’s Mountain course feeling untested. The track is full of Dye trademarks — pot bunkers, railroad ties, devilish greens — and the most spectacular holes are carved into the base of the Santa Rosa Mountains. The 2nd is one of the toughest par-3s in the California desert, and the 16th is a mean beauty that plays downhill to a pear-shaped green surrounded by danger. If life were fair, the last five holes would come up more often in discussions of golf’s best finishing stretches. Max fee: $249 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "49-499 Eisenhower Dr, La Quinta, CA 92253, USA",
      "lat": 33.688009,
      "lng": -116.3105508
    }
  },
  {
    "rank": 92,
    "course_name": "Cog Hill (No. 4)",
    "city": "Lemont",
    "state": "IL",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/cog-hill.jpg",
    "architect": "Dick Wilson/Joe Lee",
    "year_built": 1965,
    "description": "Nicknamed “Dubsdread” as a warning to “dubbers,” or poor golfers, this stout design has tested the Tour pros, too — first as the longtime host of the Western Open, and later as the stage for the BMW Championship. After a 2008 renovation by Rees Jones, ownership hoped that Cog Hill would be chosen as a U.S. Open venue. That never happened. But No. 4 remains a bear, long and heavily bunkered, with SubAir systems under every green to maintain both pace and firmness. Tiger Woods’ course record of 62 seems safe for now. Max fee: $163 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "12294 Archer Ave, Palos Park, IL 60439, USA",
      "lat": 41.6775005,
      "lng": -87.9532377
    }
  },
  {
    "rank": 93,
    "course_name": "Pronghorn (Nicklaus)",
    "city": "Bend",
    "state": "OR",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/nicklaus-pronghorn.jpg",
    "architect": "Jack Nicklaus",
    "year_built": 2003,
    "description": "This Pacific Northwest treasure is Jack Nicklaus at his high desert best. A former private course that’s still expertly conditioned, Pronghorn remains a stern test. Strategic bunkers abound, and while the fairways are wide, the greens demand precise approaches. The back nine is where Jack really cuts loose. Built on an ancient lava flow, it features spectacular rock outcroppings and a scenic waterfall by the 13th green. The unforgettable 15th is a winding uphill par-5 that rewards players with breathtaking views of the Cascade Mountains. The hole is also one of Jack’s favorites — he once referred to it as “Pine Valley West.” Max fee: $220 (Photo: Evan Schiller)",
    "detailed_location": {
      "address": "65600 Pronghorn Club Dr, Bend, OR 97701, USA",
      "lat": 44.1866357,
      "lng": -121.1741901
    }
  },
  {
    "rank": 94,
    "course_name": "Blackhawk",
    "city": "Spruce Grove",
    "state": "Alberta, Canada",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/blackhawk.jpg",
    "architect": "Rod Whitman",
    "year_built": 2003,
    "description": "As was the case with his mentor Pete Dye, architect Rod Whitman isn’t afraid to reshape the land when a site calls for it. But Whitman barely moved any dirt at all when he built Blackhawk on the banks of the North Saskatchewan River. The opening nine plays up to a plateau, followed by a brilliant back side that returns golfers to the river valley. Highlights include the majestic 11th, a 590-yard par-5 that drops more than 100 feet from tee to green, and the picturesque 12th, a charming par-3 that forces players to carry their tee shot over a river inlet. Most golfers know Whitman for his work at Cabot Links, but Blackhawk’s minimalist brilliance is evidence that he should have been on our radar long ago. Max fee: $125 (Photo: Courtesy)",
    "detailed_location": {
      "address": "51111 Range Rd 255, Spruce Grove, AB T7Y 1A8, Canada",
      "lat": 53.3853,
      "lng": -113.6614028
    }
  },
  {
    "rank": 95,
    "course_name": "Trump Golf Links at Ferry Point",
    "city": "Bronx",
    "state": "NY",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/trump-ferry-point.jpg",
    "architect": "Jack Nicklaus",
    "year_built": 2015,
    "description": "Firm, undulating turf. Wind hard off the water. Fairways dotted with fescue-covered mounds. There are moments on Trump Golf Links at Ferry Point where you’d swear you’re on the coast of Ireland. But then you look up and see the Whitestone Bridge and magnificent New York City skyline, and you remember that you’re bombing drives on a former waste dumping ground in the Bronx. Dubbed by some “The Chambers Bay of the East,” this Jack Nicklaus charmer is one of golf’s great reclamation projects and the first course built in New York City since the 1960s. It was worth the wait. Max fee: $227 (Photo: Trump Organization)",
    "detailed_location": {
      "address": "500 Hutchinson River Pkwy, Bronx, NY 10465, USA",
      "lat": 40.812471,
      "lng": -73.834446
    }
  },
  {
    "rank": 96,
    "course_name": "Stoatin Brae",
    "city": "Augusta",
    "state": "MI",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/Stoatin-Brae.jpg",
    "architect": "Eric Iverson, Don Placek, Brian Schneider, Brian Slawnik",
    "year_built": 2016,
    "description": "Heathland is a broad, open expanse of heath. Replace heath with native grasses and you have Stoatin Brae in south central Michigan. The uphill drive off the highway to the clubhouse gives nothing away about what you’re about to experience. Much of the front nine traverses a plain, and then, starting at 10, the land goes crazy — a topsy-turvy six-hole stretch that you won’t soon forget. It is one of the best stretches on this entire list, even though a lot of people don’t know about it. Other standout holes include the short par-4 8th and the one-shot 17th to a knob green. The green fee of well under $100 belies what is a first-rate design and playing experience. Max fee: $99 (Photo: LC Lambrecht)",
    "detailed_location": {
      "address": "15579 E Augusta Dr, Augusta, MI 49012, USA",
      "lat": 42.35548,
      "lng": -85.322864
    }
  },
  {
    "rank": 97,
    "course_name": "Old Waverly",
    "city": "West Point",
    "state": "MS",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/old-waverly.jpg",
    "architect": "Bob Cupp",
    "year_built": 1988,
    "description": "This modern Mississippi classic was only 11 years old when it burst onto the scene as the host site of the 1999 U.S. Women’s Open. Since then, Old Waverly has held a U.S. Women’s Amateur and six U.S. Senior Open qualifiers, solidifying its status as one of the South’s golfing jewels. The always well-conditioned layout winds around five different lakes, and architects Jerry Pate and Bob Cupp used all that water to create risk-reward opportunities throughout the course. Memorable holes abound, but the two finishers are the highlight. Seventeen is a stout par-3 that asks for a long carry over water, and the par-4 18th recalls the finisher at TPC Sawgrass’ Stadium Course, both in its hug-the-water design and its ability to produce high drama. Max fee: $170 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "Magnolia Dr, West Point, MS 39773, USA",
      "lat": 33.5743046,
      "lng": -88.60720060000001
    }
  },
  {
    "rank": 98,
    "course_name": "Memorial Park",
    "city": "Houston",
    "state": "TX",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/memorial-park.jpg",
    "architect": "John Bredemus, 1936/Tom Doak/Brooks Koepka, 2019",
    "year_built": 0,
    "description": "Another Tom Doak restoration project that nods to golf’s past while embracing its future. The original John Bredemus layout opened in 1936 and hosted the Houston Open from 1951-63. In the years since, Memorial Park has been one of the busiest munis in the country, logging more than 60,000 rounds annually. Doak’s $18.5 million renovation -— with as assist from Brooks Koepka — improved irrigation and modernized the course, making it playable for the public and challenging for pros. The fairways are generous, and Doak left only 19 bunkers on the course. But his target-oriented design rewards precision, and the back nine is built for scoring swings and tournament drama. In 2020, Memorial Park became the first Doak course to play host to a PGA Tour event. But the rates remain muni-friendly, making this one of the best deals in golf. Max fee: $140 (Photo: Keyur Khamar/PGA Tour)",
    "detailed_location": {
      "address": "Memorial Park, 6501 Memorial Dr, Houston, TX 77007, USA",
      "lat": 29.7667498,
      "lng": -95.44104689999999
    }
  },
  {
    "rank": 99,
    "course_name": "Black Mesa",
    "city": "Espanola",
    "state": "NM",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/black-mesa.jpg",
    "architect": "Baxter Spann",
    "year_built": 2003,
    "description": "New Mexico has one course in the Top 100 but four courses in the Top 125, making it a must-visit destination for every golfer. Situated on the Santa Clara Pueblo 30 minutes north of Santa Fe, this burly design boasts numerous classic design features: blind tee shots, false fronts, central hazards, greens that run from front to back. Architect Baxter Spann incorporated them all into this heaving desert landscape. The par-5 16th through a narrow canyon is a love-it-or-hate-it hole, depending on how well you fare! Max fee: $60 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "115 NM-399, Española, NM 87532, USA",
      "lat": 35.9604305,
      "lng": -106.0529103
    }
  },
  {
    "rank": 100,
    "course_name": "Hawktree",
    "city": "Bismarck",
    "state": "ND",
    "img_url": "https://golf.com/wp-content/uploads/2021/04/hawktree.jpg",
    "architect": "Jim Engh",
    "year_built": 2000,
    "description": "Award-winning architect Jim Engh is best-known as a maximalist, but Hawktree’s main lines of defense are all natural. This Midwestern marvel rambles through glacier-carved land near the Missouri River, forcing players to contend with high plains winds and water that’s in play on 11 holes. When you arrive at Hawktree, the first thing you notice are the sweeping prairie vistas — 14 holes are visible from the clubhouse. The next thing you notice are the trademark bunkers, filled with black coal slag instead of white sand. By the end of the round, you’ll be thinking, “I need to play more golf in North Dakota.” Max fee: $85 (Photo: Patrick Koenig)",
    "detailed_location": {
      "address": "3400 Burnt Creek Loop, Bismarck, ND 58503, USA",
      "lat": 46.895786,
      "lng": -100.8443125
    }
  }
]
